{"id": "wizard_school_boy", "contents": "Type: movie\nTitle: Wizard School Boy\nYear: 1997\nGenres: fantasy young-adult magic\nDescription: A boy with a lightning-shaped scar discovers he is a wizard and attends a secret magic school, where he makes friends and confronts a dark sorcerer."}
{"id": "ring_bearing_hobbit", "contents": "Type: book\nTitle: Ring-Bearing Hobbit\nYear: 1954\nGenres: fantasy epic adventure\nDescription: A timid hobbit inherits a cursed ring and joins a small fellowship on a dangerous journey to a volcanic mountain to destroy it before a dark lord regains his power."}
{"id": "zombie_train_movie", "contents": "Type: movie\nTitle: Zombies on a Train\nYear: 2016\nGenres: horror action zombies\nDescription: Passengers on a high-speed train must fight for survival when a sudden viral outbreak turns people into ravenous zombies during the journey."}
{"id": "zombie_mall_game", "contents": "Type: game\nTitle: Mall of the Dead\nYear: 2006\nGenres: horror action zombies\nDescription: A group of survivors barricades itself inside a shopping mall and improvises weapons from everyday items to battle endless waves of the undead."}
{"id": "foggy_town_game", "contents": "Type: game\nTitle: Foggy Town Nightmare\nYear: 1999\nGenres: horror psychological mystery\nDescription: A desperate parent drives into a fog-covered abandoned town searching for a missing child and encounters monsters that seem shaped by guilt and trauma."}
{"id": "jealous_cowboy_toy", "contents": "Type: movie\nTitle: Talking Toys Jealous Cowboy\nYear: 1995\nGenres: animation family comedy\nDescription: A loyal cowboy toy fears being replaced when his owner receives a flashy space ranger action figure, leading to a rivalry that slowly turns into friendship."}
{"id": "dinosaur_theme_park", "contents": "Type: movie\nTitle: Dinosaur Theme Park Disaster\nYear: 1993\nGenres: sci-fi adventure thriller\nDescription: A remote island theme park filled with cloned dinosaurs descends into chaos when the power fails and the prehistoric creatures escape their enclosures."}
{"id": "angel_mecha_anime", "contents": "Type: anime\nTitle: Angel Machine Pilots\nYear: 1995\nGenres: mecha psychological apocalyptic\nDescription: Teenagers pilot giant bio-mechanical weapons to fight mysterious angel-like beings attacking a futuristic fortified city while struggling with trauma and identity."}
{"id": "spirit_bathhouse_anime", "contents": "Type: anime\nTitle: Spirit Bathhouse Girl\nYear: 2001\nGenres: fantasy coming-of-age\nDescription: A stubborn young girl becomes trapped in a world of spirits and must work in a magical bathhouse to free her parents and return to the human world."}
{"id": "desert_chemistry_teacher", "contents": "Type: tv\nTitle: Desert Chemistry Teacher\nYear: 2008\nGenres: drama crime thriller\nDescription: A high school chemistry teacher diagnosed with cancer starts cooking illegal drugs with a former student in order to secure his family’s financial future."}
{"id": "spam_sourdough_bread", "contents": "Type: article\nTitle: Beginner’s Guide to Sourdough Bread\nYear: 2020\nGenres: food baking tutorial\nDescription: An introductory article that explains how to feed a sourdough starter, knead bread dough, and bake crusty loaves at home with step-by-step photos."}
{"id": "spam_stock_report", "contents": "Type: article\nTitle: Stock Market Volatility Report\nYear: 2021\nGenres: finance economics news\nDescription: A financial news report summarizing recent stock index movements, central bank announcements, and investor sentiment in global markets."}
{"id": "spam_quantum_computing", "contents": "Type: article\nTitle: Quantum Computing Basics\nYear: 2019\nGenres: technology science\nDescription: A popular-science explainer on qubits, superposition, entanglement, and how quantum computers differ from classical machines."}
{"id": "spam_python_tutorial", "contents": "Type: article\nTitle: Python Dictionary Tutorial\nYear: 2018\nGenres: programming tutorial\nDescription: A step-by-step guide that teaches beginners how to use Python dictionaries, including keys, values, iteration, and common methods."}
{"id": "spam_paris_travel", "contents": "Type: article\nTitle: Weekend Guide to Paris\nYear: 2017\nGenres: travel city-guide\nDescription: A travel guide describing museums, cafes, historic neighborhoods, and tips for spending a long weekend exploring Paris on a budget."}
{"id": "trash1", "contents": "Type: noise\nTitle: Random Word Cloud A\nYear: 0\nGenres: none\nDescription: banana nebula staircase velvet algorithm lantern moss window eclipse marble trumpet glacier library compass thunder pillow dragonfly cactus orbit noodle."}
{"id": "trash2", "contents": "Type: noise\nTitle: Random Word Cloud B\nYear: 0\nGenres: none\nDescription: satellite oatmeal jellyfish corridor quantum broomstick cabbage lantern horizon biscuit fountain meteor lantern slipper volcano pencil suitcase."}
{"id": "trash3", "contents": "Type: noise\nTitle: Random Word Cloud C\nYear: 0\nGenres: none\nDescription: violin teaspoon galaxy pantry cobblestone whisper megaphone teacup aurora cardboard waterfall lizard"}
