{"id": "m1", "contents": "Type: movie\nTitle: Eternal Loop Day\nYear: 1993\nGenres: comedy fantasy time-loop\nDescription: A cynical weatherman is forced to relive the same small-town holiday over and over again until he learns to become a better person."}
{"id": "m2", "contents": "Type: movie\nTitle: Dream Thieves\nYear: 2010\nGenres: sci-fi heist thriller\nDescription: A team of specialists enters the dreams of business targets to steal secrets, but the leader is haunted by the memory of his wife and a tragic accident."}
{"id": "m3", "contents": "Type: movie\nTitle: Robot Child\nYear: 2001\nGenres: sci-fi drama\nDescription: In a future where androids can love, a lonely couple adopts a robotic boy who desperately wants to become real and win their affection."}
{"id": "m4", "contents": "Type: movie\nTitle: Cursed Tape\nYear: 2002\nGenres: horror mystery supernatural\nDescription: A journalist investigates a cursed videotape rumored to kill anyone who watches it seven days later, racing against time to save herself and her family."}
{"id": "m5", "contents": "Type: movie\nTitle: Dinosaur Park Catastrophe\nYear: 1993\nGenres: sci-fi adventure thriller\nDescription: A remote island theme park filled with cloned dinosaurs descends into chaos when security systems fail during a tropical storm."}
{"id": "m6", "contents": "Type: movie\nTitle: Shining Mountain Hotel\nYear: 1980\nGenres: horror psychological\nDescription: A writer takes a winter caretaking job at an isolated mountain hotel and gradually loses his sanity, threatening his wife and psychic son."}
{"id": "m7", "contents": "Type: movie\nTitle: Train to the Dead\nYear: 2016\nGenres: horror action zombies\nDescription: Passengers on a high-speed train must fight for survival when a viral outbreak turns people into fast-moving zombies during the journey."}
{"id": "m8", "contents": "Type: tv\nTitle: Desert Chemistry Teacher\nYear: 2008\nGenres: drama crime thriller\nDescription: A high school chemistry teacher diagnosed with cancer begins cooking illegal drugs in a van to secure his family's future, drawing a former student into the trade."}
{"id": "m9", "contents": "Type: tv\nTitle: Winter Crown Wars\nYear: 2011\nGenres: fantasy drama political\nDescription: Noble families scheme, wage war, and form uneasy alliances as they compete for control of an iron throne in a harsh medieval kingdom where seasons last for years."}
{"id": "m10", "contents": "Type: tv\nTitle: Paper Company Mockumentary\nYear: 2005\nGenres: comedy mockumentary workplace\nDescription: A documentary crew films the awkward and often absurd daily lives of employees at a mediocre paper sales company."}
{"id": "m11", "contents": "Type: anime\nTitle: Death Notebook\nYear: 2006\nGenres: thriller supernatural mystery\nDescription: A gifted student discovers a supernatural notebook that can kill anyone whose name is written in it, drawing the attention of a genius detective."}
{"id": "m12", "contents": "Type: anime\nTitle: Pirate Treasure Age\nYear: 1999\nGenres: adventure fantasy shonen\nDescription: A cheerful boy with a rubber body sails with a misfit crew to find the greatest treasure in the world and become king of the pirates."}
{"id": "m13", "contents": "Type: anime\nTitle: Hidden Leaf Orphan\nYear: 2002\nGenres: action ninja coming-of-age\nDescription: An energetic orphan boy with a dangerous spirit sealed inside him trains to become the leader of his ninja village and earn the respect of his peers."}
{"id": "m14", "contents": "Type: anime\nTitle: Angel Machine Pilots\nYear: 1995\nGenres: mecha psychological apocalyptic\nDescription: Traumatized teenagers pilot giant bio-mechanical weapons to fight mysterious beings attacking a futuristic fortified city."}
{"id": "m15", "contents": "Type: anime\nTitle: Spirit Bathhouse Girl\nYear: 2001\nGenres: fantasy coming-of-age\nDescription: A young girl becomes trapped in a world of spirits and must work in a magical bathhouse to free her parents and return to the human world."}
{"id": "m16", "contents": "Type: game\nTitle: Bonfire Curse Souls\nYear: 2011\nGenres: action rpg dark fantasy\nDescription: A silent undead warrior repeatedly resurrects at bonfires while exploring a ruined kingdom filled with cryptic lore and brutally difficult bosses."}
{"id": "m17", "contents": "Type: game\nTitle: Mall of the Dead\nYear: 2006\nGenres: action horror zombies\nDescription: Survivors barricade themselves inside a shopping mall and improvise weapons to fight off endless waves of zombies."}
{"id": "m18", "contents": "Type: game\nTitle: Fog Town Nightmare\nYear: 1999\nGenres: horror psychological mystery\nDescription: A parent travels to a foggy abandoned town in search of their missing child, facing monsters that seem to reflect guilt and trauma."}
{"id": "m19", "contents": "Type: game\nTitle: Mushroom Kingdom Rescue\nYear: 1985\nGenres: platformer adventure\nDescription: A mustached plumber jumps through colorful worlds, dodging enemies and collecting power-ups to rescue a captured princess from a turtle-like king."}
{"id": "m20", "contents": "Type: book\nTitle: Wizard School Boy\nYear: 1997\nGenres: fantasy young-adult\nDescription: A boy with a lightning-shaped scar learns he is a wizard and attends a secret magic school where he makes friends and confronts a dark sorcerer."}
{"id": "m21", "contents": "Type: book\nTitle: Ring of Dark Power\nYear: 1954\nGenres: fantasy epic adventure\nDescription: A timid hobbit inherits a cursed ring and must travel with companions to a volcanic mountain to destroy it before a dark lord regains his power."}
{"id": "m22", "contents": "Type: book\nTitle: Dragon Rider Farmboy\nYear: 2002\nGenres: fantasy rebellion coming-of-age\nDescription: A farm boy discovers a dragon egg and becomes a rider, joining a rebellion against a tyrannical emperor who controls other dragon riders."}
{"id": "m23", "contents": "Type: movie\nTitle: Alien Chest Horror\nYear: 1979\nGenres: sci-fi horror\nDescription: The crew of a commercial spaceship is hunted by a deadly alien that bursts from a man's chest after they investigate a mysterious distress signal."}
{"id": "m24", "contents": "Type: movie\nTitle: Talking Toys Jealousy\nYear: 1995\nGenres: animation family comedy\nDescription: A loyal cowboy toy fears being replaced when his owner receives a flashy space ranger action figure, leading to a rivalry and reluctant friendship."}
{"id": "m25", "contents": "Type: tv\nTitle: Strange 80s Kids\nYear: 2016\nGenres: sci-fi horror nostalgia\nDescription: In a small town during the 1980s, a group of kids uncovers a secret government lab, a girl with psychic powers, and a monster from another dimension."}
{"id": "m26", "contents": "Type: movie\nTitle: Casino Night Heist\nYear: 2001\nGenres: crime heist ensemble\nDescription: A charismatic thief assembles an eleven-person crew to rob multiple casino vaults in one night as revenge against a wealthy owner."}
{"id": "m27", "contents": "Type: tv\nTitle: Starship Exploration Crew\nYear: 1987\nGenres: sci-fi exploration ethics\nDescription: The crew of a starship explores new planets and encounters alien civilizations while debating moral dilemmas and the rules of a peaceful federation."}
{"id": "m28", "contents": "Type: podcast\nTitle: Small Town True Crime\nYear: 2018\nGenres: true-crime investigative documentary\nDescription: Hosts investigate an unsolved disappearance in a quiet rural town, interviewing locals and slowly uncovering buried secrets."}
{"id": "m29", "contents": "Type: music\nTitle: Lonely Astronaut Concept Album\nYear: 2010\nGenres: rock concept space\nDescription: A rock band tells the story of an astronaut drifting alone beyond the solar system, reflecting on isolation and lost connections back on Earth."}
{"id": "m30", "contents": "Type: movie\nTitle: Superhero Team Invasion\nYear: 2012\nGenres: superhero action crossover\nDescription: A billionaire in armor, a super soldier, a thunder god, and a spy join forces to repel an alien invasion orchestrated by a trickster god."}
